[Language]
Main_Title=Seçtiğiniz için teşekkürler EaseUS Data Recovery Wizard
Sub_Title=Genel deneyiminizi nasıl değerlendirirsiniz?
Terrible=Korkunç
Poor=Fakir
Good=İyi
Great=Harika
Excellent=Mükemmel
Never_Ask_Again=Asla tekrar sorma
Rate_Now=Şimdi oyla
Feedback_Text_Tips=Lütfen geri bildiriminizi burada bırakın.
Feedback_Length_Tips=Sen 500'den fazla harf girdiniz. support@easeus.com daha geri bildirimde e-posta.